[
  {
    "q": "Khi nào tôi có thể nộp đơn gia hạn tư cách lưu trú?",
    "a": "Thông thường, bạn có thể nộp đơn gia hạn trong vòng 3 tháng trước khi hết hạn. Nên tránh thời gian cao điểm và chuẩn bị đầy đủ giấy tờ.",
    "source": "https://www.moj.go.jp/isa/"
  },
  {
    "q": "Nếu làm mất thẻ cư trú thì tôi phải làm gì?",
    "a": "Bạn cần khai báo mất tại đồn cảnh sát gần nhất, sau đó xin cấp lại thẻ cư trú tại Cục Xuất nhập cảnh. Khi nộp đơn cần có số biên nhận mất đồ.",
    "source": "https://www.moj.go.jp/isa/"
  },
  {
    "q": "Có cần xin phép hoạt động ngoài tư cách lưu trú không?",
    "a": "Du học sinh muốn làm thêm tối đa 28 giờ/tuần phải xin giấy phép hoạt động ngoài tư cách lưu trú. Làm việc không có phép là vi phạm.",
    "source": "https://www.moj.go.jp/isa/"
  },
  {
    "q": "Thủ tục khi chuyển việc là gì?",
    "a": "Người có tư cách lao động phải thông báo thay đổi nơi làm việc trong vòng 14 ngày. Có thể nộp trực tuyến.",
    "source": "https://www.moj.go.jp/isa/"
  },
  {
    "q": "Nếu thay đổi địa chỉ cư trú thì sao?",
    "a": "Bạn cần khai báo tại văn phòng chính quyền địa phương. Thẻ cư trú sẽ được cập nhật mặt sau.",
    "source": "https://www.moj.go.jp/isa/"
  },
  {
    "q": "Hồ sơ cần thiết cho visa vợ/chồng là gì?",
    "a": "Thông thường cần giấy tờ chứng minh quan hệ hôn nhân, giấy tờ về thu nhập và thuế, giấy tờ về nơi ở. Vui lòng kiểm tra hướng dẫn mới nhất.",
    "source": "https://www.moj.go.jp/isa/"
  },
  {
    "q": "Có thể làm thêm công việc phụ với visa lao động không?",
    "a": "Nguyên tắc là không được làm việc ngoài phạm vi tư cách lưu trú. Nếu cần, phải xin phép hoạt động ngoài tư cách.",
    "source": "https://www.moj.go.jp/isa/"
  },
  {
    "q": "Có thể chuyển từ visa ngắn hạn sang visa lao động không?",
    "a": "Bạn cần nộp đơn xin thay đổi tư cách lưu trú. Cần hợp đồng lao động phù hợp và điều kiện về học vấn/kinh nghiệm.",
    "source": "https://www.moj.go.jp/isa/"
  },
  {
    "q": "Nếu thẻ cư trú hết hạn thì sao?",
    "a": "Nếu quá hạn, có thể bị coi là cư trú bất hợp pháp. Bạn phải gia hạn trước khi hết hạn. Nếu đã hết hạn, hãy liên hệ ngay với Cục Xuất nhập cảnh.",
    "source": "https://www.moj.go.jp/isa/"
  },
  {
    "q": "Du học sinh muốn xin gia hạn để tìm việc cần thủ tục gì?",
    "a": "Cần thay đổi sang tư cách 'Hoạt động đặc định (tìm việc)' hoặc xin gia hạn tư cách hiện tại để chuẩn bị. Hãy làm theo hướng dẫn của trường.",
    "source": "https://www.moj.go.jp/isa/"
  }
]
